wikimedia/smash-pig/PaymentProviders/Adyen/Tests/Data/ipn_SecondChargeback.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soap:Body><sendNotification xmlns="http://notification.services.adyen.com"><notification><live>false</live><notificationItems><NotificationRequestItem><amount><currency xmlns="http://common.services.adyen.com">EUR</currency><value xmlns="http://common.services.adyen.com">200</value></amount><eventCode>SECOND_CHARGEBACK</eventCode><eventDate>2024-04-09T15:57:52+02:00</eventDate><merchantAccountCode>WikimediaDonations</merchantAccountCode><merchantReference>testMerchantRef1</merchantReference><pspReference>YOUR_PSP_REFERENCE</pspReference><reason></reason><success>true</success></NotificationRequestItem></notificationItems></notification></sendNotification></soap:Body></soap:Envelope>
